/*
#1 Написать программу с реализацией собственной функции dot(A, B),
которая производит умножение двух матриц A и B. Обязательно проверить соответствие
размерности массивов.
*/
#include <iostream>
void dot(int a, int b) {
	int m, n, k;
	std::cout << "Введите размерность матрицы А (строки и столбцы):";
	std::cin >> m >> n;
	std::cout << "Введите размерность матрицы B (только столбцы):";
	std::cin >> k;
}